IdeaRS.OpenModel.CrossSection.CrossSectionCreepCoefficientAttribute
Cross-section creep coefficient attribute
This sample shows how to create attributes for creep calculation.
//Creating the model
OpenModel openModel = new OpenModel();
//Set creep definition - on component 0, creep and notional size are calculated, humidity 60%
CrossSectionCreepCoefficientAttribute creepAttr = new CrossSectionCreepCoefficientAttribute();
creepAttr.Element = new ReferenceElement(css);
CrossSectionCreepCoefficientData creepComp = new CrossSectionCreepCoefficientData();
creepComp.CreepInput = InputValueType.Calculate;
creepComp.ComponentIndex = new List<int>() { 0 };
creepComp.Humidity = 0.6;
creepComp.NotionalSizeInput = InputValueType.Calculate;
creepAttr.Components.Add(creepComp);
openModel.AddObject(creepAttr);

IdeaRS.OpenModel.CrossSection.CrossSectionCreepCoefficientAttribute.#ctor
Constructor

IdeaRS.OpenModel.CrossSection.CrossSectionCreepCoefficientAttribute.Components
List of components